{"podcast_details": {"podcast_title": "Space 3D Podcast", "episode_title": "Season 6, Episode 6: Tales of the Space Shuttle up close with Travis Thompson, Part 3", "episode_image": "https://media.rss.com/space3dpodcast/20200508_032713_4fe630f81b4d7fb6b819971503529ce6.jpeg", "episode_transcript": " Ignition sequence starts. Six, five, four, three, two, one, zero. All engines running. Lift off. We have a lift off. Thirty-two minutes past the hour. Lift off on Apollo 11. Tower cleared. Music plays. Welcome to the Space 3D Podcast. Recently, we were honored to speak to Travis Thompson. This is part three and the conclusion of our interview. Travis Thompson was the former Orbital Vehicle Closeout Lead, or OVCC, for the Space Shuttle at Kennedy Space Center in Florida. Travis and his team assisted astronauts into the launch vehicle and were the last humans to physically be in contact with the crew prior to launch. Travis has plenty of stories to tell, as I hope you've appreciated from the first two installments of this interview. In the conclusion to our interview on this episode, Travis continues to delight us with his shuttle stories, and be sure to listen to his recollection of Alison Omizuka and John Young, along with a few other entertaining anecdotes as well. Please kindly note that we recorded our interview with Travis via phone, so the audio quality is not pristine. However, we have done our best to clean it up, so we appreciate your indulgence while listening. Were you involved in training the new closeout folks that are working with SpaceX? They didn't want any part of it. I did get a lot of phone calls. The guy that designed the slide wire system or built one in the backyard had me check it all out. I get phone calls. They're in a meeting. He goes, how big should our white room door be? I said, well, how big is the biggest payload you're going to take into the crew module? I said, two inches bigger than that. You might want an old guy in the corner going to do that. Because if you don't study your history, you're bound to repeat it. I'm convinced most of the things that we do in space is because something went wrong because we didn't do them at some point in the past. There's a lot of that, brother. Yep. Do you know that? Anytime you do the modification to the ship that requires the flight crew to deal with it on launch, on orbit, and asteroid has to oversee it. So there was this job. It took us three months on second ship on Azuka. I chose to be the second shift to oversee it. There was an astronaut section. We worked 12 12. Okay, so we were working. It had something to do with the payload day and the flight deck inside the crew. There was something we wired from there to the left side just behind door 44. Somewhere in there. Door 44 is your access from the ground into the payload. Oh, okay. Oh, wow. Yeah, door 44. I thought everybody knew that. Sorry. So it's a reference as far as inches and all that. I don't know exactly. I'd have to have the book in front of me. Still a few years. But so it took us three months to do this job and he had to oversee every, you know, I put my eye to make the brackets, do certain things. You know, when an electrical engineer sees a layout of the orb world and he wants to put his system there, he figures out how to do that. And then along comes PVD engineer and he sees blank canvas and he puts his system in. Then one day they found out that they put the same crap in the same spot. And that happened a lot. So we had to do a lot of changing. So at the end of the three months last night on second shift, he says, hey, try to tell second shift to stop by the KDI, the King's Duck Inn right off of State Road 3 on South Gate. He said, tell everybody to stop there and I'll buy a beer tonight. I said, yes, sir. I don't think that'll be a problem. He's the only astronaut. He's riding with me in my truck. I take it. Right. So we go to KDI. Now we get there and I have a beer. I'm watching, you know, I know I got a driving back. I'm being careful. I'm sipping my beer. I'm watching him. And what I didn't realize is he's mingling. He's the host. And he's just going back and forth from group to the bar, getting two more pictures and taking them to those people and go and get the two pictures. He's not drinking. I didn't notice. So three o'clock rolls around the bar is closing. He walks away from the bar. He's got a case of Budweiser under his arm. He says, OK, now I can drink. I'm like, huh? We walked out to my tailgate. There's 10 or 12 people out there. We open up, fall back, leaning, you know, into the spirit. But he's saying it's just me and him by ourselves. We're sitting there talking about everything. He told me about growing up, about flight school, why he wanted to fly. It's just there is no better feeling than hauling the butt. You know, we're talking, I'm getting enough. So it's been quiet. We're on State Road 3. Now there's traffic starting. It's getting to be about 0 600. And it's getting heavier and heavier. He goes, Bob, who are all those people? Nobody's been out here all night. I said, dude, that's day shift. There's no other way to work. He goes, that's day shift? I said, yeah. And before I could do anything, he walks over to the side of the road, dropped his pants and started manning everything. I said, that's it. We're done. We're done. That's it. We went over and snatched the beer out of his hand and threw him in my truck. And now when you drive up to the guard shack with astronaut in your truck, you know, that's pretty good. You just shoot him right in the boot. So we get to three quarters and I happened to drive around the building. I see this guard. I play softball against it. Far as part. And I said, look, you go in the back door and he got us in. I get I get him to his apartment. I open that door. I threw him down on the bed. I said, look, do not get up for eight hours. I said, don't even answer that phone. Don't talk to nobody. But he stayed right here for eight hours. I locked the door on the way out. I snuck out the back door. I made it home. Luckily. You know, you're kind of famous now because you have your suit from the close out. It's in the the aerospace museum now. Yes. These are hazies for so long in space. And my name card that's on it has five different missions. Well, a tradition commander, as he climbed into the ship, he snatched his shirt and name card off of his uniform and carried it down to the ship while they were on board it. They take pictures of it, flip around and whatever. And then when they come back, they give you your patches back and they send you the pictures. You don't get anything from NASA saying this happened. And I was in the space cowboys with Clint Eastwood. I was his technical advisor. Oh, wow. I didn't know that. I was in the movies. Well, I found some in the old and she had found a crew porters. So, gosh, you really are famous. You're a Hollywood star and you have a music something in the museum. So, yeah, I've got to do a lot of fun stuff like that. Took the enterprise to the World's Fair in 84. Oh, boy. A blue slater to open that for some dignitaries. Get there. The other dignitary, Bob Hope and Brooke Shields. Bob Hope got inside the ship and there you go. Turned into an eight year old again. I let him do it. Everyone did always on the runway. We could always tell a Navy. Yeah, because they'd stand on their brakes. You could walk up to the tire on the tarmac and there'd be one almost square foot rubber rubbed off of it and all the threads underneath. And you go up, maybe pilot. You used to land on an aircraft. And one day the commander one time told me, he said, I got seven hundred and fifty carrier landings, four hundred and fifty year at night. Which one do you want to hear about? One of the hot shots tell me one time, I said, well, what's it really like landing upon a carrier? He said, well, think of having the best sex you ever had right in the middle of a train wreck. I get it. Oh, cool people. But you know what? I tell everybody to museum when they're leaving, I said, if you didn't get anything else out of this, know that they're real people. They could be standing next to you in line at the grocery store with a blue suit. You wouldn't know. And they're down to earth. They have real lives. They do real things and they take extraordinary chance for us and for the betterment of mankind. I don't know how to write that any better. I just came out of nowhere. If you had the chance, would you have taken flight in the shuttle? Heartbeat. I would have rode in the toilet. I would have done a heartbeat. And I got to do zero G. And that was just way cool. And I trusted the vehicle, you know. I remember John asking one of the guys, he said, your bill will be fine. The guy had to think about it. I was like, I would have thought. John Young was way cool. I spent 45 minutes in the white room in the V.A.B. Waiting on a NASA quality for a job. And I got to pick his, you know, I said, damn, that was a hell of a camping trip. You know, John told me about driving the Rover. He said, I said, how pretty. He said that his vocabulary didn't contain the words to describe how beautiful it was. I thought that was cool. See, I've been around a lot of them. I was really good friends with Alan Poindexter. Alan Poindexter is the reason my uniform was in the Smithsonian. Oh, really? Yeah, I was up there taking Discovery in. I got to walk in with all 200 some odd astronauts. And we're walking through and Jack says, hey, Traver, you got your uniform? I said, yes, sir. It's in the truck. He said, go get it. Well, what else do I fill in the diesel? Yeah. So I went out to my truck, got my uniform, my hat, brought it in. And there's Valerie Neal, the curator, and next to him. And he says, this is Travis Thompson, blah, blah, blah. And now my uniform's on display. Now, here's one deal about it. Pam Booth said she came and dedicated it. And she said, I'm this uniform is the one. I'm space workers. So as long as my uniform's at the front of that line, I'm very happy. We hope you enjoyed this episode of Space 3D. We've had to slow the cadence of our podcast releases due to competing priorities. But please stay tuned for future interviews. On behalf of my co-host, Simile Carney and Tom Hill, this is Eleanor Rangers for Space 3D. Thanks for watching."}, "podcast_summary": "In this episode of the Space 3D Podcast, the host interviews Travis Thompson, the former Orbital Vehicle Closeout Lead for the Space Shuttle at Kennedy Space Center. Travis shares various stories and anecdotes from his time working with the shuttle program. He talks about overseeing the closeout process, training new closeout personnel, and even shares humorous moments, such as an astronaut's wild night out after a three-month job. Travis also discusses his personal experiences, including being a technical advisor for the movie Space Cowboys and having his space suit displayed in the aerospace museum. Throughout the interview, Travis highlights the down-to-earth nature of astronauts and their dedication to exploring space for the betterment of humanity. The episode concludes with Travis expressing his eagerness to have taken a flight on the shuttle and his admiration for astronauts like John Young and Alan Poindexter.", "podcast_guest": {"name": "Travis Thompson", "summary": "Joseph Patrick Kennedy Sr. (September 6, 1888 – November 18, 1969) was an American businessman, investor, philanthropist, and politician. He is known for his own political prominence as well as that of his children and was the patriarch of the Irish-American Kennedy family, which included President John F. Kennedy, U.S. Attorney General and Senator Robert F. Kennedy, and longtime Senator Ted Kennedy.\nKennedy was born into a political family in East Boston, Massachusetts. He made a large fortune as a stock market and commodity investor and later invested his profits in real estate and a wide range of businesses across the United States. During World War I, he was an assistant general manager of a Boston area Bethlehem Steel shipyard; through that position, he became acquainted with Franklin D. Roosevelt, who was the Assistant Secretary of the Navy. In the 1920s, Kennedy made huge profits by reorganizing and refinancing several Hollywood studios; several acquisitions were ultimately merged into Radio-Keith-Orpheum (RKO) Studios. Kennedy increased his fortune with distribution rights for Scotch whisky. He owned the largest privately owned building in the country, Chicago's Merchandise Mart.\nKennedy was a leading member of the Democratic Party and of the Irish Catholic community. President Roosevelt appointed Kennedy to be the first chairman of the Securities and Exchange Commission (SEC), which he led from 1934 to 1935. Kennedy later directed the Maritime Commission. Kennedy served as the United States Ambassador to the United Kingdom from 1938 to late 1940. With the outbreak of World War II in September 1939, Kennedy was pessimistic about Britain's ability to survive attacks from Nazi Germany. During the Battle of Britain in November 1940, Kennedy publicly suggested, \"Democracy is finished in England. It may be here [in the United States].\" After a controversy regarding this statement, Kennedy resigned his position.\nKennedy was married to Rose Fitzgerald and had nine children. During his later life, he was heavily involved in the political careers of his sons. Three of Kennedy's sons attained distinguished political positions: John served as a U.S. senator from Massachusetts and as the 35th president of the United States, Robert served as the U.S. attorney general and as a U.S. senator from New York, and Ted also served as a U.S. senator from Massachusetts."}, "podcast_highlights": "- Travis Thompson was the former Orbital Vehicle Closeout Lead at Kennedy Space Center.\n- Travis and his team assisted astronauts into the launch vehicle and were the last humans to be in contact with the crew prior to launch.\n- Travis shares stories about training new closeout folks for SpaceX and the importance of studying history to avoid repeating mistakes.\n- Travis recalls a funny incident with an astronaut at a bar during a project.\n- Travis mentions his suit being in the aerospace museum and his involvement in the movie \"Space Cowboys.\"\n- Travis reflects on the down-to-earth nature of astronauts and the risks they take for the betterment of mankind.\n- Travis expresses his desire to have taken a flight on the shuttle and his admiration for astronauts like John Young and Alan Poindexter.\n- Travis's uniform is now on display at the Smithsonian."}