{"podcast_details": {"podcast_title": "Black Girl In Om", "episode_title": "Black Women Are Worthy with Deun Ivory", "episode_image": "https://image.simplecastcdn.com/images/3bf75d66-c42a-46dd-8e70-50b4da490724/5d19a35c-fee8-4096-959b-d803eb972c9b/3000x3000/1596159562-artwork.jpg?aid=rss_feed", "episode_transcript": " Welcome. I'm Lauren Ashe and you're listening to the Black Girl in Aum podcast. Black Girl in Aum exists to hold and catalyze healing within black women around the world on their unique journeys towards wholeness. We support the necessary transformation, spiritual awakening, consciousness shifts, and intergenerational healing occurring within the diaspora. This podcast is a warm embrace, soothing realness, and conscious girl talk. Come in a conversation with me and our spirit centered guests. Let the journey begin. All right, y'all. Today's special mini-sode is with someone that honestly needs no introduction. Yes, Dion Ivory is back on the show. Yes. First of all, you much too kind, much too kind. That was so sweet. I mean, the thing is, for those who are maybe new to the podcast, I am going to also do an introduction because just in case, you know, and I would love to also have you share, of course, who you are in your own words. But for y'all who don't know Dion is the phenomenal, phenomenal founder and creative director of The Body, A Home for Love. I hope that all of you can, if you're not already, connect with them on Instagram, connect with them at their gorgeous website, thebodyahomeforlove.org. They are a 501c3 nonprofit and wellness membership space that shifts culture around how black women heal from sexual trauma. And y'all know Dion, most of you, because she also served as our art director within Black Girl and Home for a number of years. And so you've heard her here on the show sharing and conversation with me and our other amazing guests about all the things related to our journey. So again, most of you are familiar, but I love also Dion, like catch us up, right? Like, what have you been doing? Yeah, we're really going to be grounding into your amazing movement that you and your team have launched. Black women are worthy, but like, what's good? What's good? Wow, what's good? What's not good? You know, I feel like it's just been really a beautiful journey of really understanding the importance of my joy and where it leads me and how it shows up in my life and how I create from a place of endless joy. And I think that really being intentional about creating sustainable joy has allowed me to take up space in such a beautiful way in the wellness industry, especially with the projects that I'm working on with the Body at Home for Love and with Black Women Are Worthy. And, you know, this year I wanted to just expand in every way possible because I feel like God's track record with me has never failed. And it's like just been so consistent and so beautiful. And I really feel like I'm tapped in to a different stratosphere, you know, and just another level of like knowing myself intuitively and being confident in my decision making. And so even with Black Women Are Worthy, you know, that is something that is a powerful mantra that I tell myself all the time, you know, around relationships, around what I feel like I deserve to experience with people or with experiences. And I really do feel like my purpose on earth is to create a better world for Black women through all of my gifts. Yes. Whether that be through me speaking or writing or doing photography or illustrating or just creating space. And one of the beautiful things that I feel like I've been able to carve out is this genre of like creative wellness with the understanding that, you know, wellness can go beyond traditional but amazing forms of like meditation and yoga. But it's like, how is art restorative? How is art therapeutic for you? And especially as Black women, we're natural creators, but it's like, okay, how are we using that energy and those gifts to really heal our inner child or love on ourselves more or create beautiful reflections of our magic and our brilliance. And so Black Women Are Worthy came about because, I mean, 2020 was a wild year and Black women are, we're constantly being shuffled to the back whenever, you know, movements are being formed or whatever. It's kind of like Black women's needs and our wants and our safety is just not prioritized. Right. In a way that's like a sense of urgency or that important. And for me, I want to be able to create a world where we're reimagining where Black women matter only. You know what I'm saying? Yes. Where our joy and our healing and our love and all of those things are prioritized and that our needs are being met from a foundational standpoint and in other ways. And so the Body Home for Love, you know, we focus on providing trauma-informed care to Black women healing from sexual trauma and our main methodology is like healing through joy. Yes. Which is revolutionary in itself. And from that, I feel like understanding that there's a need for clinical support and creative support or creative expression is super important because I feel like there's a lot of like wellness spaces that are out there, but it's like, okay, when you're dealing with people's spirits and their souls and their energy, it's very delicate and you have to have that balance. Like I said, of like the clinical support and like the creative expression needed to really help Black women heal. But I said a lot and I'm like going in the circle because it's like so many things going on. But Black Women Are Worthy is the latest project. The film is gorgeous. It's stunning. I mean, I cry when I look at it because I'm just like, oh my God, like I really did this, but it's not I really did this. It's like God really used me in this way and created something so beautiful. And I'm just so happy that it's out in the world. I am happy. It was so moving for me to see it. And as soon as I saw it, I needed to see it again. It was one of those very like visceral visual experiences that we're used to from you, but it was a new kind of expression of your gifts, right? It was a short film. Like you went from not thinking you were going to really move into that lane. And then like you said, you're acknowledging that you're a vessel for the gifts to come through and for God to use you, which is so powerful. So it's like however God is meant to express, it's going to express through you. Okay, I'm here for you. Yes. I want to encourage everyone who hasn't yet seen this beautiful short film that really kicked off the Black Women Are Worthy movement to check out the show notes. It'll definitely be linked there. And I know that your goal is a powerful one, raising $2 million to serve and grow a community of over 10,000 black women with the trauma informed care that you spoke to and the creative wellness experiences. Yeah. I want to encourage everyone to listen, to go and donate, to support and share. At Black Girl Gnome, we've been on our own campaign season and it's one of those things where every single thing matters. Whether you share it on your Instagram, you forward an email, you give $20, like truly every single way of support matters tremendously. And there's this beautiful energy exchange that always happens when you give, it's like you receive, you receive. So I want to hear more about, because I feel like it'll inspire people, what you were saying around recognizing the gifts that you have and using them in the service of the greater good. And in this instance, the greater good is us. It's black women who are so often marginalized still for really no reason. We just like fly and fabulous and doing so much and embodying so much beauty. And it's like, y'all really just want to put us over there? Okay. I know. So do you have any moments, perhaps even in 2020, right? When you think back to the year that was 2020 and stepping into 2021 with this vision, do you have any like moments of breakthrough around realizing greater surrender that you could lean into to allow for your gifts to emerge? And the reason why I ask this question is because I feel like a lot of people now more than ever were feeling a sense of greater urgency to do something, right? To serve, to help with healing and expansion that's needed on a collective level. And a lot of times people will look to people like you or people like me and say like, oh, well, they're just, they just got it going on. They're confident. They're whatever, right? And the thing is, it's a daily moment by moment decision to stand in your power and to allow for God to use you in your gifts. So is there any moment that's even more recent that people might be surprised to even hear that was really like a wake up call for you to like dream even bigger, right? Because 2 million, that's big, right? Yeah, no, it absolutely is. I mean, I think that for one, understanding the power of my mind and the power of my why, you know, the thing that you are driven by, I mean, that could be a good thing or a bad thing or whatever, like that's your fuel, right? That's what's going to give you the permission to do whatever it is that you want to do and dream without a ceiling or just create with no restrictions. And so I think for me, I know that a lot of my healing is connected to my ability to create space for other black women to heal, right? I remember reading this thing and it's like, you know, be whatever it is that you want to receive more of. Or there's another statement that said, you know, the true mark of you having or experiencing something is sharing it with other people. And so I think that is the way that I just approach life, you know, with my knowledge or even you, you know, you do the same thing or like wisdom. It's like, I'm declaring that I have these things and like me sharing it with other people is also declaring that I have an abundance of these things. Whether that be joy, knowledge, wisdom, whatever the case is. And so, you know, I feel like life is just about self exploration and self evolution and really giving yourself an opportunity to be all of who you can be and to like, for me, it's just a challenge mentally. It's like, okay, what do I want to dream up next? You know, how do I want to show up for black women in this expansive way? And even when it's bigger than anything I've ever done, I'm like, but Dion, look at the track record. You know, last year you guys wanted to raise a hundred thousand dollars and you know, my director of development was like, I've never heard of this, a nonprofit being able to do that number in a year is just like, you know, lack of a better word, like unrealistic. And I was just like, well, that's the number that's sitting in my spirit and I'm going to cling to it. And I know that I can have it because why I am worthy of it. Right. And it's not, it's not just for me, the, the, what the money is doing, you know, the freedom to move this way, the freedom to serve black women with a level of excellence that we should be served with. Like all of that matters, all of that energetic energy, even as hilarious, energetic energy, energetic energy, you know, it matters. You know what I'm saying? And so whenever we dream like that or whenever we're asking questions or whenever we're inviting answers like that, like God answers the universe answers. And so with 2 million, that number came and I said, I'm not, I'm not about to go back and forth with the number. Like that's what it is. And we gonna keep moving. And I was just what it was. Well, and I love that because you also embody what it looks like to really stand in your worthiness, which I know is big for you obviously as a concept, as an embodiment, but to stand in your worthiness around prosperity and abundance and the sustainable support that's actually required, not just an option, but that's required for the fullest manifestation of the vision. Right. And you doing that is hella inspiring to more people than you'll ever know, particularly other black female founders, because we continue to get bombarded with all of the statistics about what we don't have. Right. Right. We're not a resource. No one gives us, no one invests in us, et cetera, et cetera, et cetera. And in ways consciously and unconsciously that has impacted all of us. So by going so big, which also here's the thing, 2 million is a lot, but and also looking at other honestly white led nonprofits, no, speak on it, 2 million might just be their starting budget. You know, so it's like in you moving in this direction already in only the second year of your organization again, super, super inspiring on the level of consciousness. Cause you know, I'm always thinking about consciousness, right? Yeah. What is it doing to that's what also makes you a thought leader, right? Like you are now expanding our collective consciousness around what it is that we as black women creators and founders and beings actually just need in order to make the impact that our collective deserves. Right. Yeah. And I think it's important too, that you said that because I was telling my friend the other day, like it shouldn't be required, no longer required for us to make lemonade out of lemons. I'm like, no, like I want to create an ecosystem of like economic sustainability and emotional sustainability in terms of like what it means to thrive. You know, how am I employing black women, helping them with their own mental health, helping to create space for them to be sustained by doing what they love by serving black women. And then how am I serving black women, helping them emotionally to thrive and like heal and like all of that. And yeah, I mean, we just deserve so much more. And I always talk about it, but you know, stepping away from my marriage was a really big thing for me because in that moment I was like, okay, Dion, you know, you can continue living this life and, and create this narrative that nothing more abundant can come out of this. If you walk away, you can stay here and just be limited to your, your mind. And I always tell people like, you are not your mind. Your mind is a tool. Yeah. Right. Yeah. Like you can detach from it. You are sold yourself, but your mind is just a, is just a tool that you use and you control that thing. You, you water that thing. Yeah. So being able to identify that I'm so much more than the thoughts that come to me day to day really helps me to expand. And I want all black women to experience that too, because sometimes we identify so heavily with the thoughts that come and I'm like, they come, but they don't have to stick. Absolutely. Absolutely. I love that. Such a powerful reminder that I don't think we hear enough. We can talk about it all day, but you know, the mind, especially in response to our creative gifts and talents and the visions that we receive, it can, if we don't be mindful of it immediately shut down or threatened to shut down the beautiful vision that even God gives us. So you reminding us of that is so powerful and so important. You know, I feel the same way when I think about black girl and home, it's like, there are so many times that I could have let doubt that entered the mind, stop me from activating a certain thing. And it's like, then this entire group of people wouldn't have ever been blessed, right? Exactly. Exactly. That is what it's about. Absolutely. Oh my goodness. So there's so much that we could talk about. I know that you had a really powerful feature in Essence, which we'll also link to. I love that. Essence is always spotlighting. It was such a great write up. It was very good write up. And I just, I think it's beautiful because, you know, when I read it, I was just like, wow, like, yes, the body of Home for Love is really only in its second year now, but the seed was planted a while ago, right? Yeah. It started with your VSCO Voices grant. And then you realized, oh, I got to continue shedding light on sexual abuse survivors and honoring our stories, honoring and documenting our reclaiming our voice and our bodies. Absolutely. And I feel like it's just powerful because that was in 2018. So really the body of Home for Love, the foundation for it in a sense, and I'm sure there were other layers and foundations in your life. But in terms of like the tangible idea was in 2018. And I just want to highlight that too, because it is a journey. Like it's all a journey. It is what? It is a journey. Oh my God. Girl. Yes. Say it again. So what's one of the key gems that you've learned on this journey of leading this powerful organization that is bringing those of us who have previously been on the margins in the center in terms of sexual assault and healing from sexual trauma and also as a now leader of a bigger movement. Black women are worthy is really a bigger movement to center black women in general. So what have been some of or one of your biggest takeaways? First of all, that was a very lengthy. I was like, wait, I thought she was going to say this. You know, answer whatever you want to answer. Honestly, this is this is about you and your voice. No, I am screaming. I love you so much. I mean, there's I mean, there's a lot of takeaways. One of them I spoke to earlier. I need people to know that there is so much emotional labor that goes into this, right? Into everything that you do. And you always have to count the cost, right? Everything comes at a price. And I don't mean that in a negative way, but it's kind of like you saying yes to this is you saying no to something else. And so that's one of the takeaways, but also to understand in that your why has to be big enough because if it's not, your vision is going to crumble. And I say that because waking up every single day and doing this work, yes, as joyful as it is. And you're like, oh my God, like when I put out this project or this product, people are experiencing this in the way I wanted them to. And just like knowing that people are receiving whatever it is with the intention that you set is one of the most fascinating, rewarding things. But I'm like Dion, every single day is not rainbows and sunshine. And if your why is not strong enough, you'll stop. And that's just the truth because it's so much, right? It's so much. But at the end of the day is worth it, which is why I get up and do it. I'm like, so many women's healing is tied to my saying yes to this. My own healing, you know what I'm saying, has been able to like be activated because I've said yes to this. And so seeing the fruit of the labor and then creating community and like really shifting, really creating new identities for black women to me is powerful because I was listening to this podcast the other day and this man was saying how there are three types of brands. The other two I forgot. One was like experiential. The other one was like product based. And then the last one was about transformation. And he was just talking about how Apple created like the entrepreneur identity. Harley Davidson created like the rebel. And it makes me think about what is the body doing? Like what identity are we reimagining for black women? It's one where black women are worthy, right? Iconic. Yes. Iconic. Yes. Transforming people. True influence, like influence in the way that you that that really shifts culture in the direction it needs to go in. Abs-a-freakin-lutely. That's the tip that we're on. Like black women being worthy of whatever it is. And so the movement is bigger because of course it speaks to not just sexual trauma but all black women's experiences. Like I'm worthy to get the job I want. I'm worthy of getting the man I want. Yes. X, Y, and Z. You know, and like just like I said, re-envisioning a world where black women are like loving themselves, freeing themselves, healing themselves and caring for themselves and not feeling like I have to apologize for it, but truly being immersed in what brings me joy. Yes. So I don't know if that answered your question, but I feel like it did. Oh, absolutely did. Absolutely did. You hit the nail on the head and you just shared a lot of things that I know will affirm and uplift per usual because that is what you do. But just very nature of living in alignment with the vision that God gave you and with all the values that are important to you. So thank you for sharing that. Yeah. I feel like, you know, I want to just again, encourage everyone to head over to blackwomenareworthy.co, the body a home for love.org to get involved. Honestly, they have a beautiful membership community as well for black women, survivors of sexual assault to come together and heal through joy. Emphasis on that. They host beautiful, beautiful wellness practitioners and trauma informed guides who really help shape experiences. I know you all do movement, meditations, all the things. Yeah, girl, we do it in all. Yeah. I mean, the healing journey is just so it's not linear and it doesn't, it's not a blanket. Nothing is blanket. Everybody has different needs and we're trying to like tailor to all of that. So yeah. Doing it beautifully as well. So thank you for all that you do. Of course. Anything else you want to leave us with Dionne? I just would like to say that, you know, I'm very thankful for you, Lauren. Thank you for having me on and just for being such a light. You know, I tell you that all the time. And then also if you're looking to join a community, you know, be sure to check out the body a home for love.org and join the membership. You know, we, it is donation based. We definitely, accessibility is one of our values. And so come through for that. And then black women are worthy is definitely a movement for black women to tap into their worth and their power and all of that. But we're also becoming an agency as well, which I'll talk to you more about on the other side of the conversation. Okay. Well with that. Yeah. Big things popping. Wow. Okay. Yeah. You just slid that in casually. Okay. I did, girl. I did. We're definitely going to be talking about that in one minute when we close this conversation. I am on the floor. I am on the floor. Thank you though. Seriously, Dionne, I appreciate you. I know our community appreciates you. We are all always cheering you on and your success is our success. I'm super thrilled to see everything that comes from this beautiful moment in history as a result of you saying yes to God's calling on your life. So thank you. Thank you. This is amazing. Such an amazing interview. And to all of you beautiful women, thank you for tuning in. Yes. Thank you. I affirm that you discovered this conversation in divine time and that you'll activate any of the insights that resonated with you powerfully moving forward. Now at Black Girl in Ome, we're all about gratitude. So special thanks to our audio engineer, India Jordan, for adding your magic. Collie B for your original music. And thank you. Yes, you for listening. Y'all, Black Girl in Ome is here for you. We're actively rewriting the narrative of what well-being looks like to ourselves and in our communities. To get more involved and learn more about us, head to blackgirlinome.com and join our newsletter while you're at it. If you do, you'll get an exclusive and free download of a meditation led by yours truly for Black Women and Girls everywhere. Are you also deepening into your journey of wholeness and healing with us on social? Follow us at Black Girl in Ome on Instagram, Twitter, and Facebook. What we're about here is real sustained impact. If you're influenced by something that you heard on our podcast and want to support, you can make a contribution today by heading to blackgirlinome.com slash support. All right, y'all breathe easy."}, "podcast_summary": "The podcast episode featured an interview with Dion Ivory, the founder and creative director of The Body, A Home for Love. The conversation focused on Dion's journey and the work she is doing to support black women in healing from sexual trauma. Dion shared her personal growth and the importance of creating sustainable joy in her life. She also discussed her latest project, Black Women Are Worthy, which aims to prioritize the needs and healing of black women. The episode highlighted the power of mindset and standing in one's worthiness, and encouraged listeners to support and donate to the cause. The discussion emphasized the importance of community and the transformative impact of reimagining identities for black women. The podcast is a source of inspiration and empowerment for black women on their healing journeys.", "podcast_guest": {"name": "Dion Ivory", "summary": "Michael Christopher Landau (born June 1, 1958) is an American musician, audio engineer, and record producer. He is a session musician and guitarist who has played on many albums since the early 1980s with Boz Scaggs, Minoru Niihara, Joni Mitchell, Rod Stewart, Seal, Michael Jackson, James Taylor, Helen Watson, Luis Miguel,  Richard Marx, Steve Perry, Pink Floyd, Phil Collins on \"Two Hearts\" and \"Loco in Acapulco\", Roger Daltrey, Stevie Nicks, Glenn Frey, Eros Ramazzotti, Whitney Houston, and Miles Davis. Landau, along with fellow session guitarists Dean Parks, Steve Lukather, Michael Thompson and Dann Huff, played on many of the major label releases recorded in Los Angeles from the 1980s–1990s. He has released music with several record labels, including Ulftone Music and Tone Center Records, a member of Shrapnel Label Group.\nIn addition to his session work, Landau has led several bands, including Raging Honkies and Burning Water. In the early 1980s, he was also in the band Maxus with Robbie Buchanan, Mark Leonard, Jay Gruska, and Doane Perry.\n\n"}, "podcast_highlights": "- The podcast is called Black Girl in Aum and it aims to catalyze healing within black women around the world.\n- The guest for the minisode is Dion Ivory, founder and creative director of The Body, a home for love.\n- The Body is a 501c3 nonprofit and wellness membership space that focuses on healing from sexual trauma.\n- Dion talks about the importance of sustainable joy and creating a better world for black women through her gifts.\n- She discusses the creation of Black Women Are Worthy, a movement that prioritizes the needs and healing of black women.\n- The goal is to raise $2 million to serve and grow a community of over 10,000 black women with trauma-informed care and creative wellness experiences.\n- Dion emphasizes the importance of having a strong why and standing in your worthiness to overcome challenges.\n- She shares her own journey of healing and how it led her to create spaces for others to heal.\n- Dion talks about the power of mindset and believing in the abundance that is possible.\n- The focus is on reimagining a world where black women are loved, healed, and their needs are met.\n- The podcast highlights the importance of community and invites listeners to join the membership or support the movement."}